[
    {
        "id": 1,
        "name": "Sun",
        "mass": "1.989 × 10³⁰ kg",
        "diameter": "864,340 mi / 1.392 million km",
        "density": "1.41 g/cm³",
        "gravity": "274 m/s²",
        "rotation_period": "24 days",
        "length_of_day": "24 days 12 hours",
        "distance_from_sun": "92.96 million mi / 150 million km",
        "orbital_period": "225 million years",
        "orbital_velocity": "250 km/s",
        "mean_temperature": "10,000°F / 5,600°C",
        "number_of_moons": "0",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "The Sun, also referred to as Sol, is the star at the center of the Solar System. Sun’s mass accounts for some 99.86% of the total mass of the Solar System. Once thought to be a relatively insignificant star, the Sun is now considered to be brighter than about 85% of the stars in the Milky Way galaxy. It is located about two thirds of the way out from the centre of the Milky Way."
    },
    {
        "id": 2,
        "name": "Mercury",
        "mass": "3.285 × 10²³ kg",
        "diameter": "3,031.9 mi / 4,878 km",
        "density": "5.43 g/cm³",
        "gravity": "3.7 m/s²",
        "rotation_period": "59 days",
        "length_of_day": "58 days, 15 hours, 30 minutes",
        "distance_from_sun": "35.98 million mi / 57.9 million km",
        "orbital_period": "88 days",
        "orbital_velocity": "47.4 km/s",
        "mean_temperature": "255°F / 123.9°C",
        "number_of_moons": "0",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Mercury is the innermost and smallest planet of the Solar System. Because it has almost no atmosphere to retain heat, Mercury’s surface experiences the greatest temperature variation of all the planets. Mercury appears as a morning or evening star from Earth, but due to its proximity to Sun, it is very hard to see. Still, Mercury can be observed at least twice a year: in spring at dusk and in autumn before dawn."
    },
    {
        "id": 1,
        "name": "Venus",
        "mass": "4.867 × 10²⁴ kg",
        "diameter": "7,520.8 mi or 12,100 km",
        "density": "5.24 g/cm³",
        "gravity": "8.87 m/s²",
        "rotation_period": "116 days, 18 hours, 0 minutes",
        "length_of_day": "116 days 18 hours 0 minutes",
        "distance_from_sun": "67.24 million mi / 108.21 million km",
        "orbital_period": "225 days",
        "orbital_velocity": "35.0 km/s",
        "mean_temperature": "864°F / 462°C",
        "number_of_moons": "0",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Although Venus has very similar size and interior structure as Earth, its volcanic surface and extremely hot and dense atmosphere makes it one of the most inhospitable places in the Solar System. Also, its similar size and density to Earth suggests that they share a common internal structure. The principal difference between the two planets is the lack of plate tectonics on Venus, likely due to the dry surface and mantle. This results in reduced heat loss from the planet, preventing it from cooling and providing a likely explanation for its lack of an internally generated magnetic field. Instead, Venus may lose its internal heat in periodic major resurfacing events."
        
    },
    {
        "id": 2,
        "name": "Earth",
        "mass": "5.972 × 10²⁴ kg",
        "diameter": "7,917.5 mi / 12741.98kg",
        "density": "5.51 g/cm³",
        "gravity": "9.81 m/s²",
        "rotation_period": "1 day",
        "length_of_day": "24 hours",
        "distance_from_sun": "92.96 million mi / 149.60 million km",
        "orbital_period": "365 days",
        "orbital_velocity": "30 km/s",
        "mean_temperature": "59°F / 15°C",
        "number_of_moons": "1",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Our homeworld is the densest of the eight planets in the Solar System. It is also the largest of the four terrestrial planets. About 71% of the Earth’s surface is covered by salt water oceans, and the remaining 30% is taken up by the seven continental landmasses. Earth’s outer surface is also divided into several rigid segments, or tectonic plates, that migrate across the surface over periods of millions of years."
        
    },
    {
        "id": 3,
        "name": "Moon",
        "mass": "7.34767309 × 10²² kg",
        "diameter": "2,158.8 mi / 3474.25km",
        "density": "3.34 g/cm³",
        "gravity": "1.62 m/s²",
        "rotation_period": "27.32 days",
        "length_of_day": "29.5 days",
        "distance_from_sun": "91.34 million mi / 147 million km",
        "orbital_period": "27 days",
        "orbital_velocity": "1 km/s",
        "mean_temperature": "-10°F / -23.33°C",
        "number_of_moons": "0",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "The Moon is Earth’s only natural satellite. Next to the Sun, the Moon exerts the greatest influence on the Earth itself, most notably through its effect on Earth’s tides. The Moon is the largest natural satellite relative to the size of its primary - having 27% percent the diameter and 60% the density of the Earth. The Moon is larger than Pluto. The Moon is the brightest object in the sky after the Sun, although its surface is actually dark, reflecting only 7 percent of the light falling on it. Moon’s current orbital distance causes it to appear almost the same size in the sky as the Sun."
        
    },
    {
        "id": 4,
        "name": "Mars",
        "mass": "6.39 × 10²³ kg",
        "diameter": "4,212.3 mi / 6,794 km",
        "density": "3.93 g/cm³",
        "gravity": "3.711 m/s²",
        "rotation_period": "1d 0h 37m",
        "length_of_day": "1d 0h 37m",
        "distance_from_sun": "141.6 million mi / 229 million km",
        "orbital_period": "687 days",
        "orbital_velocity": "24 km/s",
        "mean_temperature": "68°F / 20°C",
        "number_of_moons": "2",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Mars is the fourth planet from the Sun and the second smallest planet in the Solar System. The reddish appearance of Mars’ surface is caused by iron oxide (rust). While the Mars is about half as big as the Earth, there are still many similarities: Mars has a rocky surface and polar ice caps, the days on Mars are only 40 minutes longer, the axial tilt gives it similar seasons to ours (although each lasts about twice as long)."
        
    },
    {
        "id": 5,
        "name": "Jupiter",
        "mass": "1.898 × 10^27 kg",
        "diameter": "86,881 mi / 139,821.42 km",
        "density": "1.33 g/cm³",
        "gravity": "24.79 m/s²",
        "rotation_period": "9 hours 56 minutes",
        "length_of_day": "9 hours 56 minutes",
        "distance_from_sun": "483.8 million mi / 778 million km",
        "orbital_period": "12 years",
        "orbital_velocity": "13.1 km/s",
        "mean_temperature": "-234°F / -145°C",
        "number_of_moons": "67",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Jupiter is the largest planet of the Solar System, with a mass 2.5 greater than all of the rest of the planets combined - but still only one-thousandth that of the Sun. Jupiter is the planet most like the Sun in terms of its composition. Although Jupiter would still need to be about 75 times as massive to fuse hydrogen and become a star, it would only need to be 13 times as massive to burn deuterium and become a brown dwarf. Jupiter is composed primarily of gaseous and liquid matter. There is no surface, only a gradual change from the atmosphere. Conditions blend smoothly from gas to liquid as the temperature and pressure inside Jupiter increase steadily toward the core."
    },
    {
        "id": 6,
        "name": "Saturn",
        "mass": "5.683 × 10²⁶ kg",
        "diameter": "72,367 mi / 120,536 km",
        "density": "687 kg/m³",
        "gravity": "10.44 m/s²",
        "rotation_period": "0d 10h 42m",
        "length_of_day": "0d 10h 42m",
        "distance_from_sun": "890.8 million mi / 1.5 billion km",
        "orbital_period": "29.5 years",
        "orbital_velocity": "9.6 km/s",
        "mean_temperature": "-288°F / -178°C",
        "number_of_moons": "62",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Saturn is the sixth planet from the Sun and the second largest planet in the Solar System. Until the invention of modern telescope, Saturn was regarded as the outermost of the known planets. Although the second largest, Saturn is the least dense of all the planets in the Solar System, with only one-eighth the density of Earth (but nine times its diameter). It is also the only planet that is less dense than water. While the other gas giants also have ring systems, Saturn’s is larger and more visible than any other in the Solar System. The rings are composed of water ice crystals and a smaller amount of rock, ranging in size from specks of dust to a few particles as large as mountains."
        
    },
    {
        "id": 7,
        "name": "Uranus",
        "mass": "8.681 × 10²⁵ kg",
        "diameter": "31,518 mi / 50,724 km",
        "density": "1.27 g/cm³",
        "gravity": "8.87 m/s²",
        "rotation_period": "17 hours 14 minutes",
        "length_of_day": "17 hours 14 minutes",
        "distance_from_sun": "1.784 billion mi / 2.87 billion km",
        "orbital_period": "84 years",
        "orbital_velocity": "6.80 km/s",
        "mean_temperature": "-315.4°F / -193°C",
        "number_of_moons": "27",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Uranus is the third largest of the Solar System’s gas giants. It is the coldest planet in the Solar System. Uranus was the first to be discovered by the use of the modern telescope, with its discovery credited to the English astronomer William Herschel in 1781. While in Opposition (from the Sun, relative to the Earth), Uranus becomes visible to the naked-eye. It would appear as a faint star under dark sky conditions."
        
    },
    {
        "id": 8,
        "name": "Neptune",
        "mass": "1.024 × 10²⁶ kg",
        "diameter": "30,599 mi or 24,341 km",
        "density": "1.64 g/cm³",
        "gravity": "11.15 m/s²",
        "rotation_period": "16 hours 6 minutes",
        "length_of_day": "16 hours 6 minutes",
        "distance_from_sun": "2.793 billion mi / 150 million km",
        "orbital_period": "165 years",
        "orbital_velocity": "5.43 km/sec",
        "mean_temperature": "-353°F / -214°C",
        "number_of_moons": "14",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Neptune, is the eight and officially farthest planet from the Sun. It is the smallest but also the most dense of gas giants. Neptune has a surface gravity that is only surpassed by Jupiter. Neptune was the first planet to be discovered purely on the basis of mathematical prediction rather than by direct observation. Since it’s discovery in 1846, Neptune has completed only one orbit of the Sun."
        
    },
    {
        "id": 9,
        "name": "Pluto",
        "mass": "1.30900 × 10²² kg",
        "diameter": "1,476.8 mi / 2,376.6 km",
        "density": "1.88 g/cm³",
        "gravity": "0.62 m/s²",
        "rotation_period": "6 days 9 hours and 36 minutes",
        "length_of_day": "6 days 9 hours and 36 minutes",
        "distance_from_sun": "3.67 x 10⁹ mi / 5.91 × 10⁹ kilometers",
        "orbital_period": "248 years",
        "orbital_velocity": "4.74 km/s",
        "mean_temperature": "-380°F / -228.89°C",
        "number_of_moons": "5",
        "created_at": "2019-08-04",
        "updated_at": "",
        "description": "Pluto is the largest known dwarf planet in the Solar System, and the ninth-largest known object directly orbiting the Sun. Pluto is primarily made of ice and rock and is relatively small—about one-sixth the mass of the Moon and one-third its volume."
        
    }
]
